app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
   if params[:artist_id]
     @songs = Artist.find(params[:artist_id]).posts
   else
     @songs = Song.all